require "google/cloud/firestore"

class ApplicationController < ActionController::Base
  before_action :set_sakura

  private

  def set_sakura
    $sakuras = Firestore::LoginUser.sakura #if $sakuras.nil?

    $prefectures = { 0 => "未設定",
            1 => "東京都",
            2 => "神奈川県",
            3 => "埼玉県",
            4 => "千葉県",
            5 => "大阪府",
            6 => "京都府",
            7 => "兵庫県",
            8 => "奈良県",
            9 => "愛知県",
            10 => "岐阜県",
            11 => "三重県",
            12 => "福岡県",
            13 => "北海道",
            14 => "青森県",
            15 => "岩手県",
            16 => "宮城県",
            17 => "秋田県",
            18 => "山形県",
            19 => "福島県",
            20 => "茨城県",
            21 => "栃木県",
            22 => "群馬県",
            23 => "新潟県",
            24 => "富山県",
            25 => "石川県",
            26 => "福井県",
            27 => "山梨県",
            28 => "長野県",
            29 => "静岡県",
            30 => "滋賀県",
            31 => "和歌山県",
            32 => "鳥取県",
            33 => "島根県",
            34 => "岡山県",
            35 => "広島県",
            36 => "山口県",
            37 => "徳島県",
            38 => "香川県",
            39 => "愛媛県",
            40 => "高知県",
            41 => "佐賀県",
            42 => "長崎県",
            43 => "熊本県",
            44 => "大分県",
            45 => "宮崎県",
            46 => "鹿児島県",
            47 => "沖縄県",
            48 => "海外" }

  end
end
